---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SteelElementFailures.SteelElementModifyRangesTaskNotFinished
source: html/0b297072-e503-ef26-d178-f36a2fa21ebf.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SteelElementFailures.SteelElementModifyRangesTaskNotFinished Property

Cannot modify ranges while background calculations are in progress.

## Syntax (C#)
```csharp
public static FailureDefinitionId SteelElementModifyRangesTaskNotFinished { get; }
```